; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image6 - mode
	thermograph7 - mode
	image1 - mode
	spectrograph5 - mode
	image3 - mode
	image2 - mode
	image0 - mode
	spectrograph4 - mode
	infrared8 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph7)
	(supports instrument0 infrared8)
	(supports instrument0 image0)
	(supports instrument0 image2)
	(supports instrument0 image3)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph7)
	(supports instrument1 spectrograph4)
	(supports instrument1 image6)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image1)
	(supports instrument2 thermograph7)
	(supports instrument2 image6)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
)
(:goal (and
	(have_image Star7 image0)
	(have_image Star7 image2)
	(have_image Star7 image3)
	(have_image Star8 spectrograph5)
	(have_image Phenomenon9 image0)
	(have_image Phenomenon9 image2)
	(have_image Planet10 image0)
	(have_image Phenomenon11 image2)
	(have_image Phenomenon11 infrared8)
	(have_image Phenomenon11 image3)
	(have_image Star12 infrared8)
	(have_image Phenomenon13 image3)
	(have_image Phenomenon13 spectrograph5)
	(have_image Phenomenon13 infrared8)
))

)

; plan
1. (turn_to satellite0 groundstation6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 star12 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star12)
   goals met: 0 of 14
5. (take_image satellite0 star12 instrument0 infrared8)
   added: (have_image star12 infrared8)
   goals met: 1 of 14
6. (turn_to satellite0 planet10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet10)
   goals met: 1 of 14
7. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 2 of 14
8. (turn_to satellite0 phenomenon13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 14
9. (take_image satellite0 phenomenon13 instrument0 spectrograph5)
   added: (have_image phenomenon13 spectrograph5)
   goals met: 3 of 14
10. (take_image satellite0 phenomenon13 instrument0 infrared8)
   added: (have_image phenomenon13 infrared8)
   goals met: 4 of 14
11. (take_image satellite0 phenomenon13 instrument0 image3)
   added: (have_image phenomenon13 image3)
   goals met: 5 of 14
12. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 14
13. (take_image satellite0 phenomenon11 instrument0 infrared8)
   added: (have_image phenomenon11 infrared8)
   goals met: 6 of 14
14. (take_image satellite0 phenomenon11 instrument0 image3)
   added: (have_image phenomenon11 image3)
   goals met: 7 of 14
15. (take_image satellite0 phenomenon11 instrument0 image2)
   added: (have_image phenomenon11 image2)
   goals met: 8 of 14
16. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 8 of 14
17. (take_image satellite0 phenomenon9 instrument0 image0)
   added: (have_image phenomenon9 image0)
   goals met: 9 of 14
18. (take_image satellite0 phenomenon9 instrument0 image2)
   added: (have_image phenomenon9 image2)
   goals met: 10 of 14
19. (turn_to satellite0 star7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star7)
   goals met: 10 of 14
20. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 11 of 14
21. (take_image satellite0 star7 instrument0 image2)
   added: (have_image star7 image2)
   goals met: 12 of 14
22. (take_image satellite0 star7 instrument0 image3)
   added: (have_image star7 image3)
   goals met: 13 of 14
23. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 13 of 14
24. (take_image satellite0 star8 instrument0 spectrograph5)
   added: (have_image star8 spectrograph5)
   goals met: 14 of 14
